app/views/posts/_post.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = $1  [["post_id", 3]]
---
		  		<p>
		  		<% post.tags.each do |tag| %>

SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = $1  [["post_id", 3]]
---
	  			<ul>
	  				<% post.comments.each do |comment| %>

SELECT COUNT(*) FROM "likes"  WHERE "likes"."post_id" = $1  [["post_id", 3]]
---
	  				<%= link_to 'Show More', '#', class: 'btn btn-xs btn-info', data: {toggle: 'modal', target: ".image-modal-#{post.id}"} %>
	  				<%= link_to "❤ #{post.likes.count}", post_likes_path(post), class: 'like-btn' %>