app/views/posts/index.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = $1  [["post_id", 2]]
---
				  		<p>
				  		<% post.tags.each do |tag| %>

SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = $1  [["post_id", 2]]
---
			  			<ul>
			  				<% post.comments.each do |comment| %>

SELECT COUNT(*) FROM "likes"  WHERE "likes"."post_id" = $1  [["post_id", 2]]
---
			  				<%= link_to "Delete post", post_path(post), method: :delete, class: 'btn btn-lg btn-danger' %>
			  				<%= link_to "❤ #{post.likes.count}", post_likes_path(post), class: 'like-btn' %>