app/controllers/comments_controller.rb

	def new
  		@post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 3]]

  	def create
  		@post = Post.find(params[:post_id])
  		@post.comments.create!(params[:comment].permit(:comment))
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("comment", "created_at", "post_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment", "Awesome jetplane"], ["created_at", "2014-07-24 10:23:31.238088"], ["post_id", 3], ["updated_at", "2014-07-24 10:23:31.238088"]]