app/controllers/likes_controller.rb

	def create
		@post = Post.find params[:post_id]
		@post.likes.create
		WebsocketRails[:likes].trigger 'new', {id: @post.id, new_like_count: @post.likes.count}
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "likes" ("created_at", "post_id", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-07-24 10:18:30.633822"], ["post_id", 2], ["updated_at", "2014-07-24 10:18:30.633822"]]
SELECT COUNT(*) FROM "likes"  WHERE "likes"."post_id" = $1  [["post_id", 2]]