app/controllers/tags_controller.rb

SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = $1 LIMIT 1  [["id", 2]]
---
	def show
		@tag = Tag.find(params[:id])